#include "stc8.h"
#include "uart.h"
#include "stdlib.h"	//字符串处理库
#include "stdio.h"
#include "string.h"


/*******************************************************************************
**功能：		串口2初始化程序,9600-8-N-1，使用定时器2
**输入参数；	无
**输出参数：	无
**返回值：		无
*******************************************************************************/
void Uart2_Init()
{
	S2CON = 0x10;//模式0，10位异步收发，打开串口2使能
	T2L = BRT;
	T2H = BRT >> 8;
	AUXR = 0x14;//定时器2时钟为Fosc,即1T
	
//	AUXR &= 0xFB;		//定时器2时钟为Fosc/12,即12T
	
	IE2 |= 0x01;	 //允许串口2 中断

	
	//P_SW2 = 0X01;//RXD2_2 P40,TXD2_2 P42

	EA=1;	  //开总中断
}



/*******************************************************************************
**功能：		使用串口2发送一个字节

**输入参数；	dat 要发送的字节
**输出参数：	无
**返回值：		无
*******************************************************************************/
void Uart2_send_byte(uchar dat)	//发送一个字节
{
	IE2 &= 0xfe;	 //关闭串口2 中断
	S2BUF = dat;
	while(!(S2CON & S2TI));  //若S2TI=0，在此等待
    S2CON &= ~S2TI;          //串口2的发送标志TI清零
	IE2 |= 0x01;	 //打开串口2 中断
}
/*******************************************************************************
**功能：		使用串口2发送字符串

**输入参数；	*S 字符串首地址
**输出参数：	无
**返回值：		无
*******************************************************************************/
void Uart2_send_str(uchar *s)   //发送字符串
{
	uint u = 0;

	while(*s)	//检测非空，不是空字节即 0
	{
		Uart2_send_byte(*s++);
//		s++;
		u++;
		if(u >256)	return;	//最大发送字节数判断，超出则直接退出
	}
}



//void UART2_Isr() interrupt 8 //串口二中断处理函数
//{
//    if (S2CON & 0x02)
//    {
//        S2CON &= ~0x02; //清接收中断标志
//    }

//    if(S2CON & 0x01) //收到字符串数据
//    {		
//       S2CON &= ~0x01; //清发送中断标志
//    }	  
//}					  